#include <stdio.h>

/*
 *  1. Написать функцию проверки, является ли число простым
 */

int fPrimeNumber(int iNum);

int main()
{
    // ищем простые числав последовательности от 0 до 100
    for(int i = 0; i < 1000; i++)
    {
        if(fPrimeNumber(i))
            printf(" %d ", i);
    }
    printf("\n");

    return 0;
}

// возвращает 1 есил число простое, иначе 0.
int fPrimeNumber(int iNum)
{
    // отбрасываем значения, меньшие или равные 1
    if(iNum <= 1 )
        return 0;

    // если число 2,то сразу возвращем результат
    if(iNum == 2)
        return 1;

    // проверяем все остальные числа кроме самого числа.
    // если число разделилсоь хотябы еще на 1 число, то оно ужеточно не простое.
    for(int i = 2; i < iNum; i++ )
    {
        if(!(iNum % i))
            return 0;
    }

    return 1;
}
