/*
1.Установить среду разработки и написать программу "Привет, мир".
2.Установить или ознакомиться с инструментом визуализации алгоритмов и создать визуальное описание алгоритма умножения двух чисел.
3.Результатом выполнения задания должны стать два файла: с программой "Привет, мир" и с изображением в любом популярном формате (jpg, png, gif).
*/

#include <stdio.h>

int main()
{
    printf("Qt Creater on Windows\n");
    printf("Hello World!\n");

    return 0;
}
